Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/courts_system/wards_of_court.html.txt.tmx
Source language: en
Languages: ga

source: When a person becomes unable to manage their assets because of mental incapacity, an application can be made to the courts for them to become a Ward of Court
ga: Nuair a tharlaíonn sé nach féidir le duine a c(h)uid maoine a riaradh de bharr galair intinne, is féidir iarraidh ar na cúirteanna coimircí cúirte a dhéanamh de/di

source: The court must make a decision as to whether they are capable of managing their own property for his or her own benefit and the benefit of his or her dependants
ga: Bíonn ar an gcúirt cinneadh a dhéanamh maidir le ábaltacht an duine sin a c(h)uid maoine a riaradh ar a s(h)on féin agus ar son a c(h)uid cleithiúnaithe

source: If it is decided that the person cannot manage their own property because of mental incapacity, a Committee is appointed to control the assets on the Ward's behalf
ga: Má cheaptar nach féidir leis an duine a c(h)uid maoine a riaradh de bharr galair intinne, cuirtear Coiste i bhfeidhm chun na maoine a riaradh ar son an choimircí

source: A person under 18 years old may be taken into Wardship as a minor for reasons other than mental incapacity
ga: Is féidir le duine faoi bhun ocht mbliana déag d'aois a bheith tógtha i gCoimircíocht mar mhionúr

source: When a person is under 18 years of age and is awarded damages, the money is paid into the court and invested on the minor's behalf until they reach the age of 18
ga: Nuair a bhronntar damáistí ar dhuine faoi bhun ocht mbliana déag d'aois, íoctar an t-airgead don chúirt agus déantar infheistiú leis ar son an duine óig go dtí go mbeidh sé/sí ocht mbliana déag d'aois

source: People in this category are not Wards of Court
ga: Ní Coimircithe Cúirte iad na daoine seo

source: If, however, the minor has special housing or care needs, they may be taken into Wardship as a minor
ga: Ach, má bhíonn riachtanais speisialta tithíochta nó aire speisialta ag teastáil ón mionúr áfach, déantar Coimircí Cúirte de/di

source: If a house is bought for the minor, it is registered in their name
ga: Má cheannaítear teach do mhionúr, bíonn sé cláraithe in ainm an mhionúir

source: When they reach the age of 18 years, provided they are of full mental capacity, they can apply to the High Court for payment of any funds held on their behalf
ga: Nuair a bhíonn an mionúr ocht mbliana déag d'aois agus más rud é go bhfuil sé/sí i mbun a c(h)uid achmainní intinne ar fad, is féidir leis/léi iarraidh ar an ArdChúirt aon mhaoin atá ann ar a s(h)on a íoc leis/léi

source: To be made a Ward, the court must be satisfied that the person is of unsound mind and incapable of managing their own affairs
ga: Sula ndéantar Coimircí Cúirte d'éinne, caithfidh an chúirt a bheith sásta go bhfuil an duine sin lagintinneach agus nach féidir leis/léi a c(h)uid cúrsaí féin a riaradh

source: In some cases, a person can be taken into Wardship for their own protection
ga: I gcásanna áirithe, d'fhéadfadh duine a bheith tógtha i gcoimircíocht chun coimirce a thabhairt dó/dí

source: This would normally only arise in the case of a person with a mental disability rather than a psychiatric illness
ga: Go hiondúil, tarlaíonn sé seo nuair a bhíonn míchumas intinne ar dhuine agus ní nuair a bhíonn galar síciatrach air/uirthi

source: How a person becomes a Ward of Court
ga: An Chaoi a nDéantar Coimircí Cúirte de Dhuine

source: If you think there are grounds for someone being made a Ward of Court you should contact a solicitor to take the necessary steps
ga: De ghnáth, is ball den chlann a dhéanann an t-iarratas, ach uaireanta is é dochtúir nó dlíodóir an choimircí molta a dhéanann an t-iarratas áfach

source: Alternatively, if you do not wish to be involved in the application yourself, you should write to the Registrar of Wards of Court asking for the necessary steps to be taken
ga: Má cheapann tú go bhfuil cúiseanna ann le coimircí cúirte a dhéanamh de dhuine éigin, ba cheart teangbháil a dhéanamh le dlíodóir chun iarratas a dhéanamh

source: In either case, information must be provided about their medical condition, next-of-kin, assets and income
ga: Muna bhfuil tú ag iarraidh aon bhaint a bheith agat leis an iarratas, is féidir teangbháil a dhéanamh le Cláraitheoir na gCoimircithe Cúirte chun tús a chur leis an bproiséas

source: If you are made a Ward of Court, the court may appoint a Committee to deal with your personal affairs
ga: Dé ghnáth, (ach ní i gcónaí), is é an duine a dhéanann an t-iarratas an duine leis an gcumhacht mar Choiste ar son an Choimircí

source: The Committee means the person(s) into whose care the ward is committed
ga: Ar aon chaoi, beidh an t-eolas seo a leanas i leith an Choimircí molta ag teastáil:

source: Notice of the application must be served to the proposed Ward
ga: Caithfear an t-iarratas a chur in iúl don Choimircí Cúirte molta roimh ré

source: A proposed Ward is entitled to object to the application by writing to the Registrar of Wards of Court, usually, though not necessarily, through a solicitor
ga: Tá sé de cheart ag Coimircí Cúirte molta dul in aghaidh an iarratais ach scríobh, trí mheán dlíodóra de ghnáth (ach níl dlíodóir riachtanach), chuig Cláraitheoir na gCoimircí Cúirte

source: A Ward who has dependants has a legal duty to maintain them and the Office of Wards of Court will make arrangements to provide for their maintenance and benefit according to their needs and the Ward's means
ga: Tá dualgas de réir dlí ar Choimircí Cúirte a bhfuil cleithiúnaithe aige/aici sóláthrú dóibh. Eagróidh Oifig na gCoimircithe Cúirte liúntas cothaithe dóibh de réir na riachtanas a bheidh acu agus de réir achmhainní an Choimircí Chúirte

source: Relief and payment of income tax
ga: Íocaíocht agus Faoiseamh ar Cháin Ioncaim

source: Wards have the same requirement to submit income tax returns as other taxpayers but the return is signed by the Committee on behalf of the Ward, or by the Ward's accountant, if they employed one before being brought into Wardship
ga: Tá na dualgais chéanna ar Choimircithe Cúirte maidir le cáin ioncaim agus atá ar gach duine eile, ach bíonn an faisnéis ioncaim sínithe ag an gCoiste ar son an Choimircí Chúirte

source: The principal tax reliefs are where exemption is granted by the Chief Inspector of Taxes under Section 189 of the Taxes Consolidation Act 1997 and medical expenses
ga: An príomhfhaoiseamh cánach atá ar fáil ná faoiseamh a thugann an Príomhchigire Cánach faoi Roinn 189 den Acht um Cháin Chomhdhlúite 1997 agus costais leighis

source: After the President of the High Court has made an order bringing a person into Wardship they appoint a committee to act on behalf of the Ward and give directions to bring the Ward's assets under the control of the court and make them available for the maintenance and benefit of the Ward
ga: Oibríonn an Coiste ar son an Choimircí Chúirte agus cuireann siad maoin an Choimircí Chúirte faoi smacht na cúirte chun iad a riaradh ar mhaithe leis an gCoimircí Cúirte

source: Where it is necessary to sell the Ward’s home to provide for nursing home expenses or to prevent it from being vandalised, the Committee will be authorised by the court to put the property on the market
ga: Seo a leanas samplaí den chaoi a bhféadfaí maoin difriúla a láimhseáil:

source: Banks and building society accounts are usually closed and the proceeds lodged in court
ga: • Cuntais bhainc: Go hiondúil, dúntar na cuntais seo agus cuirtear an t-airgead i dtaisce sa chúirt

source: Property cannot be bought on behalf of a Ward as an investment because this does not at present constitute an Authorised Trustee Security
ga: Ní féidir teach a cheannach ar son Coimircí Chúirte mar infheistíocht, mar faoi láthair ní Iontaobhaí Urra Inghlactha é/í

source: A property may be bought on behalf of the Ward if they are able to reside in the community and have sufficient means and if the Ward does not have adequate or suitable accommodation
ga: Is féidir teach a cheannach ar son Coimircí Chúirte más féidir leis an gCoimircí Cúirte cónaí san áit agus go bhfuil a d(h)óthain airgid aige/aici, nó nuair nach bhfuil teach oiriúnach aige/aici cheana féin

source: If the Ward is in residential care and their dependants need to be housed, property can be bought in the name of the Ward for their benefit
ga: Más rud é go bhfuil an Coimircí Cúirte faoi chúram cónaithe agus go bhfuil teach ag teastáil óna gcleithiúnaithe, is féidir teach a cheannach ar son an Choimircí Chúirte

source: Medical care for Wards
ga: Cúraimí Leighis don Choimircí Cúirte

source: In former years, most Wards were patients in hospital or nursing homes
ga: Na blianta ó shin, ba othair in ospidéil nó i dtithe banaltrais a bhí sna Coimircithe Cúirte

source: Today, many live in the community or in sheltered accommodation
ga: Sa lá atá inniu ann, tá alán acu ina gcónaí sa phobal nó i dtithe faoi dhídean

source: If a Ward needs medical treatment for which a consent form is required by the hospital, the approval of the President of the High Court should be obtained
ga: Má bhíonn cóir leighis ag teastáil ó Choimircí Cúirte agus má theastaíonn ón ospidéal go mbeadh foirm sínithe ina leith, ba cheart cead a fháil ó Uachtarán na hArdChúirte

source: In emergency cases, it may not be possible to gain approval
ga: Nuair is cás éigeandála é, b'fhéidir nach féidir é sin a dhéanamh

source: In this case, normal medical considerations should apply
ga: Sa chás seo, leantar leis na modhanna leighis mar is ghnáth

source: A person who is a Ward because of mental incapacity cannot marry, although being taken into Wardship after marriage does not invalidate the marriage
ga: Ní féidir le duine atá ina C(h)oimircí Cúirte de bharr éagmais intinne pósadh, ach ní chiallaíonn sé gur pósadh neamhbhailí é pósadh a tharla sular deineadh Coimircí Cúirte den duine pósta

source: A Ward of Court may not leave Ireland without the consent of the President of the High Court
ga: Níl cead ag Coimircí Cúirte Éire a fhágáil gan chead ó Uachtarán na hArdChúirte

source: In practice, permission to leave the jurisdiction is normally granted, taking into account medical or safety considerations
ga: Go hiondúil, tugtar cead an Stát a fhágaint ag tógaint cúrsaí leighis agus slándála san áireamh

source: An application by a Ward to be discharged from Wardship must be made to the Registrar of Wards of Court in writing by the Ward or by a solicitor on their behalf
ga: Caithfidh Coimircí Cúirte, nó a d(h)líodóir iarratas scríofa a dhéanamh chuig Cláraitheoir na gCoimircithe Cúirte más rud é go dteastaíonn uaidh/uaithi a bheith scaoilte ó choimircíocht

source: The application should be based on medical evidence to the effect that the Ward is now sound of mind and capable of managing their own affairs
ga: Caithfidh an t-iarratas a bheith bunaithe ar fhianaise leighis ag rá go bhfuil sláinte intinne ag an gCoimircí Cúirte agus gur féidir leis/léi a c(h)uid maoine a riaradh

source: A Ward may make a will if:
ga: Is féidir le Coimircí Cúirte uacht a dhéanamh má:

source: • They express the wish to make a will
ga: • Tá fonn air/uirthi uacht a dhéanamh

source: • There is medical evidence that they are capable of making a valid will
ga: • Tá fianaise leighis ann go bhfuil an duine sin ábalta uacht a dhéanamh

source: • The solicitor instructed by the Ward is satisfied that they are capable of making a valid will
ga: • Tá dlíodóir an Choimircí Chúirte sásta go bhfuil an Coimircí Cúirte ábalta uacht éifeachtach a dhéanamh

source: When a Ward dies
ga: Nuair a fhaigheann Coimircí Cúirte bás

source: When a Ward dies, after any debts have been paid and when a Grant of Probate or Administration has issued, the estate is distributed according to the Ward's will or under the rules of intestate succession
ga: Nuair a fhaigheann Coimircí Cúirte bás, roinntear an t-eastát de réir uachta an Choimircí Chúirte, nó de réir rialacha sleachta díthiomnacha, tar éis aon fhiacha a íoc agus Deonú Probháide nó Riaracháin a eisiúint

source: Legal fees from a Wardship application are normally paid out of the Ward's estate
ga: Íoctar táillí iarratais Choimircíochta as eastát an Choimircí Chúirte

source: These costs include solicitor's fees, medical report fees and stamp duty
ga: Tugann na costais seo táillí na ndlíodóirí, táillí na dtuairiscí leighis agus stampdhleacht san áireamh

source: Court percentages (annual levy on Ward's income) are also payable
ga: Caithfear céatadáin chúirte (gearradh bliantúil ar Ioncam an Choimircí Chúirte) a íoc freisin

source: At present, the maximum rate of court percentages is €750 per annum
ga: Faoi láthair, is é 750 Euro in aghaidh na bliana an t-uasráta atá ag na céatadáin chúirte

source: This maximum rate only applies if the Ward's net income in the proceeding tax year was €18,750 or more
ga: Ní bhíonn an t-uasráta seo i bhfeidhm ach nuair nach raibh ioncam 18,750 Euro nó níos mó ag an gCoimircí Cúirte sa bhliain roimhe

source: Contact your solicitor or the Office of Wards of Court
ga: Teangbháil a dhéanamh le do dhlíodóir nó le hOifig na gCoimircithe Cúirte

source: More information is available in the Courts Service's booklet on the Office of Wards of Court (pdf)
ga: Tá tuilleadh eolais ar fáil i leabhrán na Seirbhíse Cúirteanna ar Oifig na gCoimircithe Cúirte (pdf)
